Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_adc3.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_adc3 equates.
 */
#pragma once

#include    <stdint.h>

// ADC3 address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    ISR;
    volatile    uint32_t    IER;
    volatile    uint32_t    CR;
    volatile    uint32_t    CFGR1;
    volatile    uint32_t    CFGR2;
    volatile    uint32_t    SMPR1;
    volatile    uint32_t    SMPR2;
    volatile    uint32_t    PCSEL;
    volatile    uint32_t    RESERVED0[4];
    volatile    uint32_t    SQR1;
    volatile    uint32_t    SQR2;
    volatile    uint32_t    SQR3;
    volatile    uint32_t    SQR4;
    volatile    uint32_t    DR;
    volatile    uint32_t    RESERVED1[2];
    volatile    uint32_t    JSQR;
    volatile    uint32_t    OFCFGR1;
    volatile    uint32_t    OFCFGR2;
    volatile    uint32_t    OFCFGR3;
    volatile    uint32_t    OFCFGR4;
    volatile    uint32_t    OFR1;
    volatile    uint32_t    OFR2;
    volatile    uint32_t    OFR3;
    volatile    uint32_t    OFR4;
    volatile    uint32_t    GCOMP;
    volatile    uint32_t    RESERVED2[3];
    volatile    uint32_t    JDR1;
    volatile    uint32_t    JDR2;
    volatile    uint32_t    JDR3;
    volatile    uint32_t    JDR4;
    volatile    uint32_t    RESERVED3[4];
    volatile    uint32_t    AWD2CR;
    volatile    uint32_t    AWD3CR;
    volatile    uint32_t    AWD1LTR;
    volatile    uint32_t    AWD1HTR;
    volatile    uint32_t    AWD2LTR;
    volatile    uint32_t    AWD2HTR;
    volatile    uint32_t    AWD3LTR;
    volatile    uint32_t    AWD3HTR;
    volatile    uint32_t    DIFSEL;
    volatile    uint32_t    CALFACT;
    volatile    uint32_t    RESERVED4[2];
    volatile    uint32_t    OR;
} ADC3_TypeDef;

#if (defined(__cplusplus))
#define ADC3_S  reinterpret_cast<ADC3_TypeDef *>(0x50022400u)

#else
#define ADC3_S  ((ADC3_TypeDef *)0x50022400u)
#endif

// ISR Configuration

#define ADC3_ISR_LDORDY                     (0x1u<<12)
#define ADC3_ISR_JQOVF                      (0x1u<<10)
#define ADC3_ISR_AWD3                       (0x1u<<9)
#define ADC3_ISR_AWD2                       (0x1u<<8)
#define ADC3_ISR_AWD1                       (0x1u<<7)
#define ADC3_ISR_JEOS                       (0x1u<<6)
#define ADC3_ISR_JEOC                       (0x1u<<5)
#define ADC3_ISR_OVR                        (0x1u<<4)
#define ADC3_ISR_EOS                        (0x1u<<3)
#define ADC3_ISR_EOC                        (0x1u<<2)
#define ADC3_ISR_EOSMP                      (0x1u<<1)
#define ADC3_ISR_ADRDY                      (0x1u<<0)

#define ADC3_ISR_LDORDY_B_0X0               (0x0u<<12)
#define ADC3_ISR_LDORDY_B_0X1               (0x1u<<12)
#define ADC3_ISR_JQOVF_B_0X0                (0x0u<<10)
#define ADC3_ISR_JQOVF_B_0X1                (0x1u<<10)
#define ADC3_ISR_AWD3_B_0X0                 (0x0u<<9)
#define ADC3_ISR_AWD3_B_0X1                 (0x1u<<9)
#define ADC3_ISR_AWD2_B_0X0                 (0x0u<<8)
#define ADC3_ISR_AWD2_B_0X1                 (0x1u<<8)
#define ADC3_ISR_AWD1_B_0X0                 (0x0u<<7)
#define ADC3_ISR_AWD1_B_0X1                 (0x1u<<7)
#define ADC3_ISR_JEOS_B_0X0                 (0x0u<<6)
#define ADC3_ISR_JEOS_B_0X1                 (0x1u<<6)
#define ADC3_ISR_JEOC_B_0X0                 (0x0u<<5)
#define ADC3_ISR_JEOC_B_0X1                 (0x1u<<5)
#define ADC3_ISR_OVR_B_0X0                  (0x0u<<4)
#define ADC3_ISR_OVR_B_0X1                  (0x1u<<4)
#define ADC3_ISR_EOS_B_0X0                  (0x0u<<3)
#define ADC3_ISR_EOS_B_0X1                  (0x1u<<3)
#define ADC3_ISR_EOC_B_0X0                  (0x0u<<2)
#define ADC3_ISR_EOC_B_0X1                  (0x1u<<2)
#define ADC3_ISR_EOSMP_B_0X0                (0x0u<<1)
#define ADC3_ISR_EOSMP_B_0X1                (0x1u<<1)
#define ADC3_ISR_ADRDY_B_0X0                (0x0u<<0)
#define ADC3_ISR_ADRDY_B_0X1                (0x1u<<0)

// IER Configuration

#define ADC3_IER_LDORDYIE                   (0x1u<<12)
#define ADC3_IER_JQOVFIE                    (0x1u<<10)
#define ADC3_IER_AWD3IE                     (0x1u<<9)
#define ADC3_IER_AWD2IE                     (0x1u<<8)
#define ADC3_IER_AWD1IE                     (0x1u<<7)
#define ADC3_IER_JEOSIE                     (0x1u<<6)
#define ADC3_IER_JEOCIE                     (0x1u<<5)
#define ADC3_IER_OVRIE                      (0x1u<<4)
#define ADC3_IER_EOSIE                      (0x1u<<3)
#define ADC3_IER_EOCIE                      (0x1u<<2)
#define ADC3_IER_EOSMPIE                    (0x1u<<1)
#define ADC3_IER_ADRDYIE                    (0x1u<<0)

#define ADC3_IER_LDORDYIE_B_0X0             (0x0u<<12)
#define ADC3_IER_LDORDYIE_B_0X1             (0x1u<<12)
#define ADC3_IER_JQOVFIE_B_0X0              (0x0u<<10)
#define ADC3_IER_JQOVFIE_B_0X1              (0x1u<<10)
#define ADC3_IER_AWD3IE_B_0X0               (0x0u<<9)
#define ADC3_IER_AWD3IE_B_0X1               (0x1u<<9)
#define ADC3_IER_AWD2IE_B_0X0               (0x0u<<8)
#define ADC3_IER_AWD2IE_B_0X1               (0x1u<<8)
#define ADC3_IER_AWD1IE_B_0X0               (0x0u<<7)
#define ADC3_IER_AWD1IE_B_0X1               (0x1u<<7)
#define ADC3_IER_JEOSIE_B_0X0               (0x0u<<6)
#define ADC3_IER_JEOSIE_B_0X1               (0x1u<<6)
#define ADC3_IER_JEOCIE_B_0X0               (0x0u<<5)
#define ADC3_IER_JEOCIE_B_0X1               (0x1u<<5)
#define ADC3_IER_OVRIE_B_0X0                (0x0u<<4)
#define ADC3_IER_OVRIE_B_0X1                (0x1u<<4)
#define ADC3_IER_EOSIE_B_0X0                (0x0u<<3)
#define ADC3_IER_EOSIE_B_0X1                (0x1u<<3)
#define ADC3_IER_EOCIE_B_0X0                (0x0u<<2)
#define ADC3_IER_EOCIE_B_0X1                (0x1u<<2)
#define ADC3_IER_EOSMPIE_B_0X0              (0x0u<<1)
#define ADC3_IER_EOSMPIE_B_0X1              (0x1u<<1)
#define ADC3_IER_ADRDYIE_B_0X0              (0x0u<<0)
#define ADC3_IER_ADRDYIE_B_0X1              (0x1u<<0)

// CR Configuration

#define ADC3_CR_ADCAL                       (0x1u<<31)
#define ADC3_CR_ADCALDIF                    (0x1u<<30)
#define ADC3_CR_DEEPPWD                     (0x1u<<29)
#define ADC3_CR_ADVREGEN                    (0x1u<<28)
#define ADC3_CR_JADSTP                      (0x1u<<5)
#define ADC3_CR_ADSTP                       (0x1u<<4)
#define ADC3_CR_JADSTART                    (0x1u<<3)
#define ADC3_CR_ADSTART                     (0x1u<<2)
#define ADC3_CR_ADDIS                       (0x1u<<1)
#define ADC3_CR_ADEN                        (0x1u<<0)

#define ADC3_CR_ADCAL_B_0X0                 (0x0u<<31)
#define ADC3_CR_ADCAL_B_0X1                 (0x1u<<31)
#define ADC3_CR_ADCALDIF_B_0X0              (0x0u<<30)
#define ADC3_CR_ADCALDIF_B_0X1              (0x1u<<30)
#define ADC3_CR_DEEPPWD_B_0X0               (0x0u<<29)
#define ADC3_CR_DEEPPWD_B_0X1               (0x1u<<29)
#define ADC3_CR_ADVREGEN_B_0X0              (0x0u<<28)
#define ADC3_CR_ADVREGEN_B_0X1              (0x1u<<28)
#define ADC3_CR_JADSTP_B_0X0                (0x0u<<5)
#define ADC3_CR_JADSTP_B_0X1                (0x1u<<5)
#define ADC3_CR_ADSTP_B_0X0                 (0x0u<<4)
#define ADC3_CR_ADSTP_B_0X1                 (0x1u<<4)
#define ADC3_CR_JADSTART_B_0X0              (0x0u<<3)
#define ADC3_CR_JADSTART_B_0X1              (0x1u<<3)
#define ADC3_CR_ADSTART_B_0X0               (0x0u<<2)
#define ADC3_CR_ADSTART_B_0X1               (0x1u<<2)
#define ADC3_CR_ADDIS_B_0X0                 (0x0u<<1)
#define ADC3_CR_ADDIS_B_0X1                 (0x1u<<1)
#define ADC3_CR_ADEN_B_0X0                  (0x0u<<0)
#define ADC3_CR_ADEN_B_0X1                  (0x1u<<0)

// CFGR1 Configuration

#define ADC3_CFGR1_JQDIS                    (0x1u<<31)
#define ADC3_CFGR1_AWD1CH                   (0x1Fu<<26)
#define ADC3_CFGR1_AWD1CH_0                 (0x1u<<26)
#define ADC3_CFGR1_JAUTO                    (0x1u<<25)
#define ADC3_CFGR1_JAWD1EN                  (0x1u<<24)
#define ADC3_CFGR1_AWD1EN                   (0x1u<<23)
#define ADC3_CFGR1_AWD1SGL                  (0x1u<<22)
#define ADC3_CFGR1_JQM                      (0x1u<<21)
#define ADC3_CFGR1_JDISCEN                  (0x1u<<20)
#define ADC3_CFGR1_DISCNUM                  (0x7u<<17)
#define ADC3_CFGR1_DISCNUM_0                (0x1u<<17)
#define ADC3_CFGR1_DISCEN                   (0x1u<<16)
#define ADC3_CFGR1_AUTDLY                   (0x1u<<14)
#define ADC3_CFGR1_CONT                     (0x1u<<13)
#define ADC3_CFGR1_OVRMOD                   (0x1u<<12)
#define ADC3_CFGR1_EXTEN                    (0x3u<<10)
#define ADC3_CFGR1_EXTEN_0                  (0x1u<<10)
#define ADC3_CFGR1_EXTSEL                   (0x1Fu<<5)
#define ADC3_CFGR1_EXTSEL_0                 (0x1u<<5)
#define ADC3_CFGR1_RES                      (0x3u<<2)
#define ADC3_CFGR1_RES_0                    (0x1u<<2)
#define ADC3_CFGR1_DMNGT                    (0x3u<<0)
#define ADC3_CFGR1_DMNGT_0                  (0x1u<<0)

#define ADC3_CFGR1_JQDIS_B_0X0              (0x0u<<31)
#define ADC3_CFGR1_JQDIS_B_0X1              (0x1u<<31)
#define ADC3_CFGR1_AWD1CH_B_0X0             (0x0u<<26)
#define ADC3_CFGR1_AWD1CH_B_0X1             (0x1u<<26)
#define ADC3_CFGR1_AWD1CH_B_0X13            (0x13u<<26)
#define ADC3_CFGR1_JAUTO_B_0X0              (0x0u<<25)
#define ADC3_CFGR1_JAUTO_B_0X1              (0x1u<<25)
#define ADC3_CFGR1_JAWD1EN_B_0X0            (0x0u<<24)
#define ADC3_CFGR1_JAWD1EN_B_0X1            (0x1u<<24)
#define ADC3_CFGR1_AWD1EN_B_0X0             (0x0u<<23)
#define ADC3_CFGR1_AWD1EN_B_0X1             (0x1u<<23)
#define ADC3_CFGR1_AWD1SGL_B_0X0            (0x0u<<22)
#define ADC3_CFGR1_AWD1SGL_B_0X1            (0x1u<<22)
#define ADC3_CFGR1_JQM_B_0X0                (0x0u<<21)
#define ADC3_CFGR1_JQM_B_0X1                (0x1u<<21)
#define ADC3_CFGR1_JDISCEN_B_0X0            (0x0u<<20)
#define ADC3_CFGR1_JDISCEN_B_0X1            (0x1u<<20)
#define ADC3_CFGR1_DISCNUM_B_0X0            (0x0u<<17)
#define ADC3_CFGR1_DISCNUM_B_0X1            (0x1u<<17)
#define ADC3_CFGR1_DISCNUM_B_0X7            (0x7u<<17)
#define ADC3_CFGR1_DISCEN_B_0X0             (0x0u<<16)
#define ADC3_CFGR1_DISCEN_B_0X1             (0x1u<<16)
#define ADC3_CFGR1_AUTDLY_B_0X0             (0x0u<<14)
#define ADC3_CFGR1_AUTDLY_B_0X1             (0x1u<<14)
#define ADC3_CFGR1_CONT_B_0X0               (0x0u<<13)
#define ADC3_CFGR1_CONT_B_0X1               (0x1u<<13)
#define ADC3_CFGR1_OVRMOD_B_0X0             (0x0u<<12)
#define ADC3_CFGR1_OVRMOD_B_0X1             (0x1u<<12)
#define ADC3_CFGR1_EXTEN_B_0X0              (0x0u<<10)
#define ADC3_CFGR1_EXTEN_B_0X1              (0x1u<<10)
#define ADC3_CFGR1_EXTEN_B_0X2              (0x2u<<10)
#define ADC3_CFGR1_EXTEN_B_0X3              (0x3u<<10)
#define ADC3_CFGR1_EXTSEL_B_0X0             (0x0u<<5)
#define ADC3_CFGR1_EXTSEL_B_0X1             (0x1u<<5)
#define ADC3_CFGR1_EXTSEL_B_0X2             (0x2u<<5)
#define ADC3_CFGR1_EXTSEL_B_0X3             (0x3u<<5)
#define ADC3_CFGR1_EXTSEL_B_0X4             (0x4u<<5)
#define ADC3_CFGR1_EXTSEL_B_0X5             (0x5u<<5)
#define ADC3_CFGR1_EXTSEL_B_0X6             (0x6u<<5)
#define ADC3_CFGR1_EXTSEL_B_0X7             (0x7u<<5)
#define ADC3_CFGR1_EXTSEL_B_0X1F            (0x1Fu<<5)
#define ADC3_CFGR1_RES_B_0X0                (0x0u<<2)
#define ADC3_CFGR1_RES_B_0X1                (0x1u<<2)
#define ADC3_CFGR1_RES_B_0X2                (0x2u<<2)
#define ADC3_CFGR1_RES_B_0X3                (0x3u<<2)
#define ADC3_CFGR1_DMNGT_B_0X0              (0x0u<<0)
#define ADC3_CFGR1_DMNGT_B_0X1              (0x1u<<0)
#define ADC3_CFGR1_DMNGT_B_0X2              (0x2u<<0)
#define ADC3_CFGR1_DMNGT_B_0X3              (0x3u<<0)

// CFGR2 Configuration

#define ADC3_CFGR2_LSHIFT                   (0xFu<<28)
#define ADC3_CFGR2_LSHIFT_0                 (0x1u<<28)
#define ADC3_CFGR2_OVSR                     (0x3FFu<<16)
#define ADC3_CFGR2_OVSR_0                   (0x1u<<16)
#define ADC3_CFGR2_SMPTRIG                  (0x1u<<15)
#define ADC3_CFGR2_SWTRIG                   (0x1u<<14)
#define ADC3_CFGR2_BULB                     (0x1u<<13)
#define ADC3_CFGR2_ROVSM                    (0x1u<<10)
#define ADC3_CFGR2_TROVS                    (0x1u<<9)
#define ADC3_CFGR2_OVSS                     (0xFu<<5)
#define ADC3_CFGR2_OVSS_0                   (0x1u<<5)
#define ADC3_CFGR2_JOVSE                    (0x1u<<1)
#define ADC3_CFGR2_ROVSE                    (0x1u<<0)

#define ADC3_CFGR2_LSHIFT_B_0X0             (0x0u<<28)
#define ADC3_CFGR2_LSHIFT_B_0X1             (0x1u<<28)
#define ADC3_CFGR2_LSHIFT_B_0X2             (0x2u<<28)
#define ADC3_CFGR2_LSHIFT_B_0X3             (0x3u<<28)
#define ADC3_CFGR2_LSHIFT_B_0X4             (0x4u<<28)
#define ADC3_CFGR2_LSHIFT_B_0X5             (0x5u<<28)
#define ADC3_CFGR2_LSHIFT_B_0X6             (0x6u<<28)
#define ADC3_CFGR2_LSHIFT_B_0X7             (0x7u<<28)
#define ADC3_CFGR2_LSHIFT_B_0X8             (0x8u<<28)
#define ADC3_CFGR2_LSHIFT_B_0X9             (0x9u<<28)
#define ADC3_CFGR2_LSHIFT_B_0XA             (0xAu<<28)
#define ADC3_CFGR2_LSHIFT_B_0XB             (0xBu<<28)
#define ADC3_CFGR2_LSHIFT_B_0XC             (0xCu<<28)
#define ADC3_CFGR2_LSHIFT_B_0XD             (0xDu<<28)
#define ADC3_CFGR2_LSHIFT_B_0XE             (0xEu<<28)
#define ADC3_CFGR2_LSHIFT_B_0XF             (0xFu<<28)
#define ADC3_CFGR2_OVSR_B_0X0               (0x0u<<16)
#define ADC3_CFGR2_OVSR_B_0X1               (0x1u<<16)
#define ADC3_CFGR2_SMPTRIG_B_0X0            (0x0u<<15)
#define ADC3_CFGR2_SMPTRIG_B_0X1            (0x1u<<15)
#define ADC3_CFGR2_SWTRIG_B_0X0             (0x0u<<14)
#define ADC3_CFGR2_SWTRIG_B_0X1             (0x1u<<14)
#define ADC3_CFGR2_BULB_B_0X0               (0x0u<<13)
#define ADC3_CFGR2_BULB_B_0X1               (0x1u<<13)
#define ADC3_CFGR2_ROVSM_B_0X0              (0x0u<<10)
#define ADC3_CFGR2_ROVSM_B_0X1              (0x1u<<10)
#define ADC3_CFGR2_TROVS_B_0X0              (0x0u<<9)
#define ADC3_CFGR2_TROVS_B_0X1              (0x1u<<9)
#define ADC3_CFGR2_OVSS_B_0X0               (0x0u<<5)
#define ADC3_CFGR2_OVSS_B_0X1               (0x1u<<5)
#define ADC3_CFGR2_OVSS_B_0X2               (0x2u<<5)
#define ADC3_CFGR2_OVSS_B_0X3               (0x3u<<5)
#define ADC3_CFGR2_OVSS_B_0X4               (0x4u<<5)
#define ADC3_CFGR2_OVSS_B_0X5               (0x5u<<5)
#define ADC3_CFGR2_OVSS_B_0X6               (0x6u<<5)
#define ADC3_CFGR2_OVSS_B_0X7               (0x7u<<5)
#define ADC3_CFGR2_OVSS_B_0X8               (0x8u<<5)
#define ADC3_CFGR2_OVSS_B_0X9               (0x9u<<5)
#define ADC3_CFGR2_OVSS_B_0XA               (0xAu<<5)
#define ADC3_CFGR2_JOVSE_B_0X0              (0x0u<<1)
#define ADC3_CFGR2_JOVSE_B_0X1              (0x1u<<1)
#define ADC3_CFGR2_ROVSE_B_0X0              (0x0u<<0)
#define ADC3_CFGR2_ROVSE_B_0X1              (0x1u<<0)

// SMPR1 Configuration

#define ADC3_SMPR1_SMP9                     (0x7u<<27)
#define ADC3_SMPR1_SMP9_0                   (0x1u<<27)
#define ADC3_SMPR1_SMP8                     (0x7u<<24)
#define ADC3_SMPR1_SMP8_0                   (0x1u<<24)
#define ADC3_SMPR1_SMP7                     (0x7u<<21)
#define ADC3_SMPR1_SMP7_0                   (0x1u<<21)
#define ADC3_SMPR1_SMP6                     (0x7u<<18)
#define ADC3_SMPR1_SMP6_0                   (0x1u<<18)
#define ADC3_SMPR1_SMP5                     (0x7u<<15)
#define ADC3_SMPR1_SMP5_0                   (0x1u<<15)
#define ADC3_SMPR1_SMP4                     (0x7u<<12)
#define ADC3_SMPR1_SMP4_0                   (0x1u<<12)
#define ADC3_SMPR1_SMP3                     (0x7u<<9)
#define ADC3_SMPR1_SMP3_0                   (0x1u<<9)
#define ADC3_SMPR1_SMP2                     (0x7u<<6)
#define ADC3_SMPR1_SMP2_0                   (0x1u<<6)
#define ADC3_SMPR1_SMP1                     (0x7u<<3)
#define ADC3_SMPR1_SMP1_0                   (0x1u<<3)
#define ADC3_SMPR1_SMP0                     (0x7u<<0)
#define ADC3_SMPR1_SMP0_0                   (0x1u<<0)

#define ADC3_SMPR1_SMP9_B_0X0               (0x0u<<27)
#define ADC3_SMPR1_SMP9_B_0X1               (0x1u<<27)
#define ADC3_SMPR1_SMP9_B_0X2               (0x2u<<27)
#define ADC3_SMPR1_SMP9_B_0X3               (0x3u<<27)
#define ADC3_SMPR1_SMP9_B_0X4               (0x4u<<27)
#define ADC3_SMPR1_SMP9_B_0X5               (0x5u<<27)
#define ADC3_SMPR1_SMP9_B_0X6               (0x6u<<27)
#define ADC3_SMPR1_SMP9_B_0X7               (0x7u<<27)
#define ADC3_SMPR1_SMP8_B_0X0               (0x0u<<24)
#define ADC3_SMPR1_SMP8_B_0X1               (0x1u<<24)
#define ADC3_SMPR1_SMP8_B_0X2               (0x2u<<24)
#define ADC3_SMPR1_SMP8_B_0X3               (0x3u<<24)
#define ADC3_SMPR1_SMP8_B_0X4               (0x4u<<24)
#define ADC3_SMPR1_SMP8_B_0X5               (0x5u<<24)
#define ADC3_SMPR1_SMP8_B_0X6               (0x6u<<24)
#define ADC3_SMPR1_SMP8_B_0X7               (0x7u<<24)
#define ADC3_SMPR1_SMP7_B_0X0               (0x0u<<21)
#define ADC3_SMPR1_SMP7_B_0X1               (0x1u<<21)
#define ADC3_SMPR1_SMP7_B_0X2               (0x2u<<21)
#define ADC3_SMPR1_SMP7_B_0X3               (0x3u<<21)
#define ADC3_SMPR1_SMP7_B_0X4               (0x4u<<21)
#define ADC3_SMPR1_SMP7_B_0X5               (0x5u<<21)
#define ADC3_SMPR1_SMP7_B_0X6               (0x6u<<21)
#define ADC3_SMPR1_SMP7_B_0X7               (0x7u<<21)
#define ADC3_SMPR1_SMP6_B_0X0               (0x0u<<18)
#define ADC3_SMPR1_SMP6_B_0X1               (0x1u<<18)
#define ADC3_SMPR1_SMP6_B_0X2               (0x2u<<18)
#define ADC3_SMPR1_SMP6_B_0X3               (0x3u<<18)
#define ADC3_SMPR1_SMP6_B_0X4               (0x4u<<18)
#define ADC3_SMPR1_SMP6_B_0X5               (0x5u<<18)
#define ADC3_SMPR1_SMP6_B_0X6               (0x6u<<18)
#define ADC3_SMPR1_SMP6_B_0X7               (0x7u<<18)
#define ADC3_SMPR1_SMP5_B_0X0               (0x0u<<15)
#define ADC3_SMPR1_SMP5_B_0X1               (0x1u<<15)
#define ADC3_SMPR1_SMP5_B_0X2               (0x2u<<15)
#define ADC3_SMPR1_SMP5_B_0X3               (0x3u<<15)
#define ADC3_SMPR1_SMP5_B_0X4               (0x4u<<15)
#define ADC3_SMPR1_SMP5_B_0X5               (0x5u<<15)
#define ADC3_SMPR1_SMP5_B_0X6               (0x6u<<15)
#define ADC3_SMPR1_SMP5_B_0X7               (0x7u<<15)
#define ADC3_SMPR1_SMP4_B_0X0               (0x0u<<12)
#define ADC3_SMPR1_SMP4_B_0X1               (0x1u<<12)
#define ADC3_SMPR1_SMP4_B_0X2               (0x2u<<12)
#define ADC3_SMPR1_SMP4_B_0X3               (0x3u<<12)
#define ADC3_SMPR1_SMP4_B_0X4               (0x4u<<12)
#define ADC3_SMPR1_SMP4_B_0X5               (0x5u<<12)
#define ADC3_SMPR1_SMP4_B_0X6               (0x6u<<12)
#define ADC3_SMPR1_SMP4_B_0X7               (0x7u<<12)
#define ADC3_SMPR1_SMP3_B_0X0               (0x0u<<9)
#define ADC3_SMPR1_SMP3_B_0X1               (0x1u<<9)
#define ADC3_SMPR1_SMP3_B_0X2               (0x2u<<9)
#define ADC3_SMPR1_SMP3_B_0X3               (0x3u<<9)
#define ADC3_SMPR1_SMP3_B_0X4               (0x4u<<9)
#define ADC3_SMPR1_SMP3_B_0X5               (0x5u<<9)
#define ADC3_SMPR1_SMP3_B_0X6               (0x6u<<9)
#define ADC3_SMPR1_SMP3_B_0X7               (0x7u<<9)
#define ADC3_SMPR1_SMP2_B_0X0               (0x0u<<6)
#define ADC3_SMPR1_SMP2_B_0X1               (0x1u<<6)
#define ADC3_SMPR1_SMP2_B_0X2               (0x2u<<6)
#define ADC3_SMPR1_SMP2_B_0X3               (0x3u<<6)
#define ADC3_SMPR1_SMP2_B_0X4               (0x4u<<6)
#define ADC3_SMPR1_SMP2_B_0X5               (0x5u<<6)
#define ADC3_SMPR1_SMP2_B_0X6               (0x6u<<6)
#define ADC3_SMPR1_SMP2_B_0X7               (0x7u<<6)
#define ADC3_SMPR1_SMP1_B_0X0               (0x0u<<3)
#define ADC3_SMPR1_SMP1_B_0X1               (0x1u<<3)
#define ADC3_SMPR1_SMP1_B_0X2               (0x2u<<3)
#define ADC3_SMPR1_SMP1_B_0X3               (0x3u<<3)
#define ADC3_SMPR1_SMP1_B_0X4               (0x4u<<3)
#define ADC3_SMPR1_SMP1_B_0X5               (0x5u<<3)
#define ADC3_SMPR1_SMP1_B_0X6               (0x6u<<3)
#define ADC3_SMPR1_SMP1_B_0X7               (0x7u<<3)
#define ADC3_SMPR1_SMP0_B_0X0               (0x0u<<0)
#define ADC3_SMPR1_SMP0_B_0X1               (0x1u<<0)
#define ADC3_SMPR1_SMP0_B_0X2               (0x2u<<0)
#define ADC3_SMPR1_SMP0_B_0X3               (0x3u<<0)
#define ADC3_SMPR1_SMP0_B_0X4               (0x4u<<0)
#define ADC3_SMPR1_SMP0_B_0X5               (0x5u<<0)
#define ADC3_SMPR1_SMP0_B_0X6               (0x6u<<0)
#define ADC3_SMPR1_SMP0_B_0X7               (0x7u<<0)

